tiborsimon/embedded-tdd-headers/pic/8bit/pic18f27k40_tdd.h
#define PWM3DCL_DC0                   2207
#define PWM3DCL_DC                    2208
#define PWM3DC1                       2209
#define PWM3DCL_PWMPW1                2210
#define PWM3DCL_DC1                   2211
#define PWM3DCH                       2212
#define PWM3DC2                       2213
#define PWM3DCH_DC2                   2214
#define PWM3DCH_DC                    2215
#define PWM3DCH_PWMPW2                2216
#define PWM3DC3                       2217
#define PWM3DCH_DC3                   2218
#define PWM3DCH_PWMPW3                2219
#define PWM3DC4                       2220
#define PWM3DCH_DC4                   2221
#define PWM3DCH_PWMPW4                2222
#define PWM3DC5                       2223
#define PWM3DCH_DC5                   2224
#define PWM3DCH_PWMPW5                2225
#define PWM3DC6                       2226
#define PWM3DCH_DC6                   2227
#define PWM3DCH_PWMPW6                2228
#define PWM3DC7                       2229
#define PWM3DCH_DC7                   2230
#define PWM3DCH_PWMPW7                2231
#define PWM3DC8                       2232
#define PWM3DCH_DC8                   2233
#define PWM3DCH_PWMPW8                2234
#define PWM3DC9                       2235
#define PWM3DCH_DC9                   2236
#define PWM3DCH_PWMPW9                2237
#define PWM3CON                       2238
#define PWM3CON_POL                   2239
#define PWM3POL                       2240
#define PWM3CON_OUT                   2241
#define PWM3OUT                       2242
#define PWM3EN                        2243
#define PWM3CON_EN                    2244
#define CCPR2L                        2245
#define CCPR2L_RL                     2246
#define CCPR2H                        2247
#define CCPR2H_RH                     2248
#define CCP2CON                       2249
#define CCP2MODE                      2250
#define CCP2MODE0                     2251
#define CCP2CON_MODE0                 2252
#define CCP2CON_MODE                  2253
#define CCP2MODE1                     2254
#define CCP2CON_MODE1                 2255
#define CCP2MODE2                     2256
#define CCP2CON_MODE2                 2257
#define CCP2MODE3                     2258
#define CCP2CON_MODE3                 2259
#define CCP2FMT                       2260
#define CCP2CON_FMT                   2261
#define CCP2OUT                       2262
#define CCP2CON_OUT                   2263
#define CCP2EN                        2264
#define CCP2CON_EN                    2265
#define CCP2CAP                       2266
#define CCP2CAP_CTS                   2267
#define CCP2CAP_CTS0                  2268
#define CCP2CTS                       2269
#define CCP2CTS0                      2270
#define CCP2CAP_CTS1                  2271
#define CCP2CTS1                      2272
#define CCPR1L                        2273
#define CCPR1L_RL                     2274
#define CCPR1H                        2275
#define CCPR1H_RH                     2276
#define CCP1CON                       2277
#define CCP1MODE0                     2278
#define CCP1CON_MODE0                 2279
#define CCP1CON_MODE                  2280
#define CCP1MODE                      2281
#define CCP1MODE1                     2282
#define CCP1CON_MODE1                 2283
#define CCP1MODE2                     2284
#define CCP1CON_MODE2                 2285
#define CCP1MODE3                     2286
#define CCP1CON_MODE3                 2287
#define CCP1FMT                       2288
#define CCP1CON_FMT                   2289
#define CCP1CON_OUT                   2290
#define CCP1OUT                       2291
#define CCP1EN                        2292
#define CCP1CON_EN                    2293
#define P1M1                          2294
#define CCP1CAP                       2295
#define CCP1CTS0                      2296
#define CCP1CAP_CTS                   2297
#define CCP1CAP_CTS0                  2298
#define CCP1CTS                       2299
#define CCP1CTS1                      2300
#define CCP1CAP_CTS1                  2301
#define CCPTMRS                       2302
#define C1TSEL0                       2303
#define C1TSEL                        2304
#define C1TSEL1                       2305
#define C2TSEL0                       2306
#define C2TSEL                        2307
#define C2TSEL1                       2308
#define P3TSEL                        2309
#define P3TSEL0                       2310
#define P3TSEL1                       2311
#define P4TSEL0                       2312
#define P4TSEL                        2313
#define P4TSEL1                       2314
#define T6TMR                         2315
#define TMR6                          2316
#define T6PR                          2317
#define PR6                           2318
#define T6CON                         2319
#define T6CON_OUTPS0                  2320
#define T6OUTPS                       2321
#define T6CON_OUTPS                   2322
#define T6OUTPS0                      2323
#define T6CON_OUTPS1                  2324
#define T6OUTPS1                      2325
#define T6CON_OUTPS2                  2326
#define T6OUTPS2                      2327
#define T6CON_OUTPS3                  2328
#define T6OUTPS3                      2329
#define T6CON_CKPS0                   2330
#define T6CKPS                        2331
#define T6CKPS0                       2332
#define T6CON_CKPS                    2333
#define T6CON_CKPS1                   2334
#define T6CKPS1                       2335
#define T6CON_CKPS2                   2336
#define T6CKPS2                       2337
#define TMR6ON                        2338
#define T6ON                          2339
#define T6CON_ON                      2340
#define T6HLT                         2341
#define T6HLT_MODE0                   2342
#define T6HLT_MODE                    2343
#define T6MODE0                       2344
#define T6MODE                        2345
#define T6HLT_MODE1                   2346
#define T6MODE1                       2347
#define T6MODE2                       2348
#define T6HLT_MODE2                   2349
#define T6HLT_MODE3                   2350
#define T6MODE3                       2351
#define T6MODE4                       2352
#define T6HLT_MODE4                   2353
#define T6CKSYNC                      2354
#define T6HLT_CKSYNC                  2355
#define T6CKPOL                       2356
#define T6HLT_CKPOL                   2357
#define T6PSYNC                       2358
#define T6HLT_PSYNC                   2359
#define T6CLKCON                      2360
#define T6CS                          2361
#define T6CS0                         2362
#define T6CS1                         2363
#define T6CS2                         2364
#define T6CS3                         2365
#define T6RST                         2366
#define T6RST_RSEL                    2367
#define T6RST_RSEL0                   2368
#define T6RSEL                        2369
#define T6RSEL0                       2370
#define T6RST_RSEL1                   2371
#define T6RSEL1                       2372
#define T6RSEL2                       2373
#define T6RST_RSEL2                   2374
#define T6RST_RSEL3                   2375
#define T6RSEL3                       2376
#define T4TMR                         2377
#define TMR4                          2378
#define T4PR                          2379
#define PR4                           2380
#define T4CON                         2381
#define T4OUTPS0                      2382
#define T4CON_OUTPS                   2383
#define T4OUTPS                       2384
#define T4CON_OUTPS0                  2385
#define T4OUTPS1                      2386
#define T4CON_OUTPS1                  2387
#define T4CON_OUTPS2                  2388
#define T4OUTPS2                      2389
#define T4OUTPS3                      2390
#define T4CON_OUTPS3                  2391
#define T4CON_CKPS0                   2392
#define T4CKPS0                       2393
#define T4CON_CKPS                    2394
#define T4CKPS                        2395
#define T4CKPS1                       2396
#define T4CON_CKPS1                   2397
#define T4CKPS2                       2398
#define T4CON_CKPS2                   2399
#define T4ON                          2400
#define T4CON_ON                      2401
#define TMR4ON                        2402
#define T4HLT                         2403
#define T4MODE                        2404
#define T4HLT_MODE                    2405
#define T4HLT_MODE0                   2406
#define T4MODE0                       2407
#define T4HLT_MODE1                   2408
#define T4MODE1                       2409
#define T4HLT_MODE2                   2410
#define T4MODE2                       2411
#define T4HLT_MODE3                   2412
#define T4MODE3                       2413
#define T4HLT_MODE4                   2414
#define T4MODE4                       2415
#define T4HLT_CKSYNC                  2416
#define T4CKSYNC                      2417
#define T4HLT_CKPOL                   2418
#define T4CKPOL                       2419
#define T4PSYNC                       2420
#define T4HLT_PSYNC                   2421
#define T4CLKCON                      2422
#define T4CS0                         2423
#define T4CS                          2424
#define T4CS1                         2425
#define T4CS2                         2426
#define T4CS3                         2427
#define T4RST                         2428
#define T4RSEL0                       2429
#define T4RSEL                        2430
#define T4RST_RSEL                    2431
#define T4RST_RSEL0                   2432
#define T4RSEL1                       2433
#define T4RST_RSEL1                   2434
#define T4RSEL2                       2435
#define T4RST_RSEL2                   2436
#define T4RSEL3                       2437
#define T4RST_RSEL3                   2438
#define T2TMR                         2439
#define TMR2                          2440
#define T2PR                          2441
#define PR2                           2442
#define T2CON                         2443
#define T2OUTPS0                      2444
#define T2CON_OUTPS0                  2445
#define T2OUTPS                       2446
#define T2CON_OUTPS                   2447
#define T2OUTPS1                      2448
#define T2CON_OUTPS1                  2449
#define T2OUTPS2                      2450
#define T2CON_OUTPS2                  2451
#define T2OUTPS3                      2452
#define T2CON_OUTPS3                  2453
#define T2CKPS0                       2454
#define T2CON_CKPS                    2455
#define T2CKPS                        2456
#define T2CON_CKPS0                   2457
#define T2CKPS1                       2458
#define T2CON_CKPS1                   2459
#define T2CKPS2                       2460
#define T2CON_CKPS2                   2461
#define T2CON_ON                      2462
#define TMR2ON                        2463
#define T2ON                          2464
#define T2HLT                         2465
#define T2HLT_MODE                    2466
#define T2MODE                        2467
#define T2MODE0                       2468
#define T2HLT_MODE0                   2469
#define T2MODE1                       2470
#define T2HLT_MODE1                   2471
#define T2MODE2                       2472
#define T2HLT_MODE2                   2473
#define T2MODE3                       2474
#define T2HLT_MODE3                   2475
#define T2MODE4                       2476
#define T2HLT_MODE4                   2477
#define T2HLT_CKSYNC                  2478
#define T2CKSYNC                      2479
#define T2HLT_CKPOL                   2480
#define T2CKPOL                       2481
#define T2PSYNC                       2482
#define T2HLT_PSYNC                   2483
#define T2CLKCON                      2484
#define T2CS                          2485
#define T2CS0                         2486
#define T2CS1                         2487
#define T2CS2                         2488
#define T2CS3                         2489
#define T2RST                         2490
#define T2RSEL0                       2491
#define T2RST_RSEL                    2492
#define T2RSEL                        2493
#define T2RST_RSEL0                   2494
#define T2RSEL1                       2495
#define T2RST_RSEL1                   2496
#define T2RST_RSEL2                   2497
#define T2RSEL2                       2498
#define T2RSEL3                       2499
#define T2RST_RSEL3                   2500
#define TMR5L                         2501
#define TMR5L0                        2502
#define TMR5L1                        2503
#define TMR5L2                        2504
#define TMR5L3                        2505
#define TMR5L4                        2506
#define TMR5L5                        2507
#define TMR5L6                        2508
#define TMR5L7                        2509
#define TMR5H0                        2510
#define TMR5H                         2511
#define TMR5H1                        2512
#define TMR5H2                        2513
#define TMR5H3                        2514
#define TMR5H4                        2515
#define TMR5H5                        2516
#define TMR5H6                        2517
#define TMR5H7                        2518
#define T5CON                         2519
#define T5CON_ON                      2520
#define TMR5ON                        2521
#define T5CON_RD16                    2522
#define T5RD16                        2523
#define RD165                         2524
#define nT5SYNC                       2525
#define T5CON_nSYNC                   2526
#define T5CON_NOT_SYNC                2527
#define NOT_T5SYNC                    2528
#define T5CON_CKPS0                   2529
#define T5CON_CKPS                    2530
#define T5CKPS0                       2531
#define T5CON_CKPS1                   2532
#define T5CKPS1                       2533
#define T5GCON                        2534
#define T5GCON_GVAL                   2535
#define T5GVAL                        2536
#define T5GGO_nDONE                   2537
#define T5GCON_GGO_NOT_DONE           2538
#define T5GCON_GGO_nDONE              2539
#define T5GGO_NOT_DONE                2540
#define T5GGO                         2541
#define T5GCON_GSPM                   2542
#define T5GSPM                        2543
#define T5GTM                         2544
#define T5GCON_GTM                    2545
#define T5GPOL                        2546
#define T5GCON_GPOL                   2547
#define T5GCON_GE                     2548
#define T5GE                          2549
#define T5GATE                        2550
#define T5GATE_GSS0                   2551
#define T5GSS0                        2552
#define T5GATE_GSS                    2553
#define T5GATE_GSS1                   2554
#define T5GSS1                        2555
#define T5GATE_GSS2                   2556
#define T5GSS2                        2557
#define T5GATE_GSS3                   2558
#define T5GSS3                        2559
#define T5CLK                         2560
#define T5CS0                         2561
#define T5CLK_CS                      2562
#define T5CLK_CS0                     2563
#define T5CS1                         2564
#define T5CLK_CS1                     2565
#define T5CS2                         2566
#define T5CLK_CS2                     2567
#define T5CS3                         2568
#define T5CLK_CS3                     2569
#define TMR3L0                        2570
#define TMR3L                         2571
#define TMR3L1                        2572
#define TMR3L2                        2573
#define TMR3L3                        2574
#define TMR3L4                        2575
#define TMR3L5                        2576
#define TMR3L6                        2577
#define TMR3L7                        2578
#define TMR3H                         2579
#define TMR3H0                        2580
#define TMR3H1                        2581
#define TMR3H2                        2582
#define TMR3H3                        2583
#define TMR3H4                        2584
#define TMR3H5                        2585
#define TMR3H6                        2586
#define TMR3H7                        2587
#define T3CON                         2588
#define T3CON_ON                      2589
#define TMR3ON                        2590
#define T3CON_RD16                    2591
#define RD163                         2592
#define T3RD16                        2593
#define T3CON_NOT_SYNC                2594
#define T3CON_nSYNC                   2595
#define NOT_T3SYNC                    2596
#define nT3SYNC                       2597
#define T3CKPS0                       2598
#define T3CON_CKPS0                   2599
#define T3CON_CKPS                    2600
#define T3CKPS1                       2601
#define T3CON_CKPS1                   2602
#define T3GCON                        2603
#define T3GVAL                        2604
#define T3GCON_GVAL                   2605
#define T3GGO                         2606
#define T3GGO_NOT_DONE                2607
#define T3GCON_GGO_nDONE              2608
#define T3GGO_nDONE                   2609
#define T3GCON_GGO_NOT_DONE           2610
#define T3GCON_GSPM                   2611
#define T3GSPM                        2612
#define T3GCON_GTM                    2613
#define T3GTM                         2614
#define T3GCON_GPOL                   2615
#define T3GPOL                        2616
#define T3GCON_GE                     2617
#define T3GE                          2618
#define T3GATE                        2619
#define T3GSS0                        2620
#define T3GATE_GSS0                   2621
#define T3GATE_GSS                    2622
#define T3GSS1                        2623
#define T3GATE_GSS1                   2624
#define T3GSS2                        2625
#define T3GATE_GSS2                   2626
#define T3GSS3                        2627
#define T3GATE_GSS3                   2628
#define T3CLK                         2629
#define T3CLK_CS                      2630
#define T3CLK_CS0                     2631
#define T3CS0                         2632
#define T3CLK_CS1                     2633
#define T3CS1                         2634
#define T3CLK_CS2                     2635
#define T3CS2                         2636
#define T3CS3                         2637
#define T3CLK_CS3                     2638
#define TMR1L                         2639
#define TMR1L0                        2640
#define TMR1L1                        2641
#define TMR1L2                        2642
#define TMR1L3                        2643
#define TMR1L4                        2644
#define TMR1L5                        2645
#define TMR1L6                        2646
#define TMR1L7                        2647
#define TMR1H0                        2648
#define TMR1H                         2649
#define TMR1H1                        2650
#define TMR1H2                        2651
#define TMR1H3                        2652
#define TMR1H4                        2653
#define TMR1H5                        2654
#define TMR1H6                        2655
#define TMR1H7                        2656
#define T1CON                         2657
#define TMR1ON                        2658
#define T1CON_ON                      2659
#define T1CON_RD16                    2660
#define T1RD16                        2661
#define NOT_T1SYNC                    2662
#define T1CON_nSYNC                   2663
#define nT1SYNC                       2664
#define T1CON_NOT_SYNC                2665
#define T1CON_CKPS0                   2666
#define T1CKPS0                       2667
#define T1CON_CKPS                    2668
#define T1CKPS1                       2669
#define T1CON_CKPS1                   2670
#define T1GCON                        2671
#define T1GCON_GVAL                   2672
#define T1GVAL                        2673
#define T1GGO_NOT_DONE                2674
#define T1GGO_nDONE                   2675
#define T1GCON_GGO_nDONE              2676
#define T1GCON_GGO_NOT_DONE           2677
#define T1GGO                         2678
#define T1GCON_GSPM                   2679
#define T1GSPM                        2680
#define T1GTM                         2681
#define T1GCON_GTM                    2682
#define T1GPOL                        2683
#define T1GCON_GPOL                   2684
#define T1GCON_GE                     2685
#define T1GE                          2686
#define T1GATE                        2687
#define T1GATE_GSS0                   2688
#define T1GSS0                        2689
#define T1GATE_GSS                    2690
#define T1GATE_GSS1                   2691
#define T1GSS1                        2692
#define T1GSS2                        2693
#define T1GATE_GSS2                   2694
#define T1GSS3                        2695
#define T1GATE_GSS3                   2696
#define T1CLK                         2697
#define T1CS0                         2698
#define T1CLK_CS                      2699
#define T1CLK_CS0                     2700
#define T1CLK_CS1                     2701
#define T1CS1                         2702
#define T1CS2                         2703
#define T1CLK_CS2                     2704
#define T1CS3                         2705
#define T1CLK_CS3                     2706
#define TMR0L0                        2707
#define TMR0L                         2708
#define TMR0L1                        2709
#define TMR0L2                        2710
#define TMR0L3                        2711
#define TMR0L4                        2712
#define TMR0L5                        2713
#define TMR0L6                        2714
#define TMR0L7                        2715
#define TMR0H0                        2716
#define T0PR                          2717
#define TMR0H                         2718
#define T0PR0                         2719
#define TMR0H1                        2720
#define T0PR1                         2721
#define TMR0H2                        2722
#define T0PR2                         2723
#define TMR0H3                        2724
#define T0PR3                         2725
#define TMR0H4                        2726
#define T0PR4                         2727
#define TMR0H5                        2728
#define T0PR5                         2729
#define TMR0H6                        2730
#define T0PR6                         2731
#define TMR0H7                        2732
#define T0PR7                         2733
#define T0CON0                        2734
#define T0OUTPS                       2735
#define T0OUTPS0                      2736
#define T0OUTPS1                      2737
#define T0OUTPS2                      2738
#define T0OUTPS3                      2739
#define T016BIT                       2740
#define T0OUT                         2741
#define T0EN                          2742
#define T0CON1                        2743
#define T0PS                          2744
#define T0CKPS                        2745
#define T0CKPS0                       2746
#define T0PS0                         2747
#define T0CKPS1                       2748
#define T0PS1                         2749
#define T0CKPS2                       2750
#define T0PS2                         2751
#define T0CKPS3                       2752
#define T0PS3                         2753
#define T0ASYNC                       2754
#define T0CS                          2755
#define T0CS0                         2756
#define T0CS1                         2757
#define T0CS2                         2758
#define PCON0                         2759
#define BOR                           2760
#define NOT_BOR                       2761
#define nBOR                          2762
#define POR                           2763
#define nPOR                          2764
