tiborsimon/embedded-tdd-headers/pic/8bit/pic18f27k40_tdd.h
#define NOT_POR                       2765
#define nRI                           2766
#define NOT_RI                        2767
#define RI                            2768
#define NOT_RMCLR                     2769
#define nRMCLR                        2770
#define RMCLR                         2771
#define NOT_RWDT                      2772
#define nRWDT                         2773
#define RWDT                          2774
#define nWDTWV                        2775
#define WDTWV                         2776
#define NOT_WDTWV                     2777
#define STKUNF                        2778
#define STKOVF                        2779
#define STATUS                        2780
#define C                             2781
#define CARRY                         2782
#define STATUS_DC                     2783
#define ZERO                          2784
#define Z                             2785
#define OV                            2786
#define OVERFLOW                      2787
#define N                             2788
#define NEGATIVE                      2789
#define PD                            2790
#define nPD                           2791
#define NOT_PD                        2792
#define TO                            2793
#define NOT_TO                        2794
#define nTO                           2795
#define FSR2L                         2796
#define PLUSW2                        2797
#define PREINC2                       2798
#define POSTDEC2                      2799
#define POSTINC2                      2800
#define INDF2                         2801
#define FSR1L                         2802
#define PLUSW1                        2803
#define PREINC1                       2804
#define POSTDEC1                      2805
#define POSTINC1                      2806
#define INDF1                         2807
#define WREG                          2808
#define FSR0L                         2809
#define PLUSW0                        2810
#define PREINC0                       2811
#define POSTDEC0                      2812
#define POSTINC0                      2813
#define INDF0                         2814
#define INTCON                        2815
#define INT0EDG                       2816
#define INT1EDG                       2817
#define INT2EDG                       2818
#define IPEN                          2819
#define PEIE                          2820
#define PEIE_GIEL                     2821
#define GIEL                          2822
#define GIE                           2823
#define GIE_GIEH                      2824
#define GIEH                          2825
#define PRODL                         2826
#define PRODH                         2827
#define TABLAT                        2828
#define TBLPTRL                       2829
#define TBLPTRH                       2830
#define TBLPTRU                       2831
#define ACSS                          2832
#define PCL                           2833
#define PCLATH                        2834
#define PCLATH_PCH                    2835
#define PCLATU                        2836
#define PCU                           2837
#define STKPTR0                       2838
#define STKPTR                        2839
#define SP0                           2840
#define STKPTR1                       2841
#define SP1                           2842
#define STKPTR2                       2843
#define SP2                           2844
#define SP3                           2845
#define STKPTR3                       2846
#define STKPTR4                       2847
#define SP4                           2848
#define STKPTR5                       2849
#define SP5                           2850
#define TOSL                          2851
#define TOSH                          2852

#endif // _PIC18F27K40_H_
